In [1]:
import pandas as pd
df1=pd.DataFrame({
    "city":["new york","chicago","orlando"],
    "temperature":[21,14,35]
})
df1

       city  temperature
0  new york           21
1   chicago           14
2   orlando           35

In [2]:
df2=pd.DataFrame({
    "city":["chicago","new york","Sanfrancisco"],
    "humidity":[65,68,75]
})
df2

           city  humidity
0       chicago        65
1      new york        68
2  Sanfrancisco        75

In [5]:
#Inner Join
df3=pd.merge(df1,df2,on="city")
df3

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65

In [6]:
#Outer Join
df3=pd.merge(df1,df2,on="city",how="outer")
df3

           city  temperature  humidity
0      new york         21.0      68.0
1       chicago         14.0      65.0
2       orlando         35.0       NaN
3  Sanfrancisco          NaN      75.0

In [7]:
#Left Join
df3=pd.merge(df1,df2,on="city",how="left")
df3

       city  temperature  humidity
0  new york           21      68.0
1   chicago           14      65.0
2   orlando           35       NaN

In [8]:
#Right Join
df3=pd.merge(df1,df2,on="city",how="right")
df3

           city  temperature  humidity
0      new york         21.0        68
1       chicago         14.0        65
2  Sanfrancisco          NaN        75

In [9]:
#Outer Join
df3=pd.merge(df1,df2,on="city",how="outer",indicator=True)
df3

           city  temperature  humidity      _merge
0      new york         21.0      68.0        both
1       chicago         14.0      65.0        both
2       orlando         35.0       NaN   left_only
3  Sanfrancisco          NaN      75.0  right_only